{
  "projects": [



    {
      "name": "joeboylson.us",
      "description": "This website: a self-defining project that has evolved as I have.",
      "date": "03.18 ─ present",
      "title_image": "/images/joeboylson/fullscreen.png",
      "context": "Personal Project",
      "role": "Everything . . . I did everything.",
      "technologies": "React.js, Create React App, Typescript, Express.js, Heroku",
      "links": [
        {
          "text": "GitHub Project",
          "href": "https://github.com/joeboylson/joeboylson"
        }
      ],
      "synopsis": "Over the past 3 years, I've been learning more and more about web development; consequently this website has evolved and changed as I have and has allowed me to explore and implement the technologies that interest me that I might not be able to use at work. It has also given me the chance to try my hand at web design and UI/UX practices. If the pattern continues, I'll probably be re-writing this entire site within a year (so don't get too comfortable).",
      "sections": []
    },



    {
      "name": "mattboylson.com",
      "description": "A portfolio collaboration with designer and relative Matt Boylson",
      "date": "10.19 ─ 01.20",
      "title_image": "/images/mattboylson/fullscreen.png",
      "context": "Designer Portfolio Project",
      "with": "Matt Boylson",
      "role": "Developer, Cousin",
      "technologies": "React.js, Create React App, Typescript, Express.js, Heroku",
      "links": [
        {
          "text": "Matt's Portfolio Site",
          "href": "https://mattboylson.com"
        }
      ],
      "synopsis": "Developing this site with Matt marked a milestone in my career as a Web Developer because this was my first freelance project. Matt came to me with a lot of great ideas and I'm very grateful to him for allowing me to build his site. Because this was a relatively small codebase (and primarily user-facing), we were able to implement a lot of very interesting interactive elements and behaviors. We focused a lot on \"the grid\", responsive design, and re-usable and modular components.",
      "sections": []
    },



    {
      "name": "Web Game Development",
      "description": "A few web games I created in school that use basic JavaScript strategies",
      "date": "08.19 ─ 12.19",
      "title_image": "/images/web_game_development/fullscreen.png",
      "context": "Web Game Development Course (University of Cincinnati)",
      "with": null,
      "role": "Student, Designer, Developer",
      "technologies": "Vanilla Javascript, RequestAnimationFrame, HTML Canvas, React, Express.js, Heroku",
      "links": [
        {
          "text": "GitHub Project",
          "href": "https://github.com/joeboylson/WebGameDevelopment"
        },
        {
          "text": "Live Site (may take a moment to load)",
          "href": "https://web-game-development.herokuapp.com/"
        }
      ],
      "synopsis": "Creating these games was a lot of fun and we were able to use a lot of technologies that wouldn't regularly have a place in a standard web application. I aimed to use simple HTML, CSS, and JavaScript for these projects and not use any external libraries except where absolutely necessary (for instance, a library for a collision detection algorithm).",
      "sections": []
    },



    {
      "name": "A Developer's Resume",
      "description": "With so many resume creation tools out there, I chose to use none of them",
      "date": "01.20",
      "title_image": "/images/resume/fullscreen.png",
      "context": "A Fun Weekend Project",
      "role": "Developer, Nerd",
      "technologies": "HTML, CSS, html5-to-pdf (npm package)",
      "links": [
        {
          "text": "Download my resume",
          "href": "https://joeboylson.herokuapp.com/cv"
        },
        {
          "text": "View HTML page",
          "href": "http://joeboylson.herokuapp.com/resume.html"
        }
      ],
      "synopsis": "Usually people use a tool to create their resume: not me. Instead, I chose to create my resume as a simple HTML file - for fun. I used html5-to-pdf to convert the HTML file into a PDF. It works great!",
      "sections": []
    }



  ]
}